/* გამოკლების ოპერაცია λ-აღრიცხვაში (λ-calculus)

სასარგებლო მასალა:
    ილიას სახელმწიფო უნივერსიტეტის გამოთვლითი ცენტრი
    https://www.facebook.com/watch/live/?ref=search&v=6591820374222486 (1:17:55)

    Gabriel Lebec - Fullstack Academy
    https://www.youtube.com/watch?v=3VQ382QG-y4
*/




/* ------------------------------ ეს სექცია არ შეცვალოთ ----------------------------- */
/* ---------------------- სექციის დასაწყისი: დამხმარე ფუნქციები ---------------------- */
const NEXT = n => f => a => f(n(f)(a))
const zero = f => a => a
/* ---------------------- სექციის დასასრული: დამხმარე ფუნქციები ---------------------- */





/* ---------------------------- შეცვალეთ მხოლოდ ეს სექცია --------------------------- */
/* ------------------------- სექციის დასაწყისი: თქვენი პასუხი ------------------------- */

/* უნდა შექმნათ ფუნქცია MINUS,
 * რომელიც პარამეტრად აიღებს ორ "რიცხვს": n, m (n≥m) და დააბრუნებს მათ სხვაობას n-m
 */

/* წინასწარ შეგიძლიათ განსაზღვროთ სხვა დამხმარე ფუნქციები, როგორც ზემოთ ფუნქცია NEXT,
 * და გამოიყენოთ ისინი ფუნქცია MINUS-ის აღწერაში
 */

/* დამხმარე ფუნქციები - თქვენი სურვილი მიხედვით */

/* დავალების მთავარი ნაწილი - ფუნქცია MINUS-ის განსაზღვა.
 * გამოიყენეთ მხოლოდ ფუნქციები - განსაზღვრა და გამოძახება.*/
// ======================================================================================
const MINUS
// ======================================================================================
/* ---------------------- სექციის დასასრული: დამხმარე ფუნქციები ---------------------- */





/* ------------------------------ ეს სექცია არ შეცვალოთ ----------------------------- */
/* ----------------------------- სექციის დასაწყისი: ტესტი  -------------------------- */
// რამდენიმე λ-რიცხვის განსაზღვრა
const one = NEXT(zero)
const two = NEXT(one)
const three = NEXT(two)
const four = NEXT(three)
const five = NEXT(four)
const six = NEXT(five)
const seven = NEXT(six)
const eight = NEXT(seven)
const nine = NEXT(eight)
const ten = NEXT(nine)
// სატესტო ფუნქცია
const addBall = s => s + '⚽'
// რამდენიმე ტესტი
console.assert(MINUS(ten)(one)(addBall)('!') === nine(addBall)('!'), '10 - 1')
console.assert(MINUS(eight)(one)(addBall)('!') === seven(addBall)('!'), '8 - 1')
console.assert(MINUS(seven)(zero)(addBall)('!') === seven(addBall)('!'), '7 - 0')
console.assert(MINUS(nine)(five)(addBall)('!') === four(addBall)('!'), '9 - 5')
console.assert(MINUS(five)(five)(addBall)('!') === zero(addBall)('!'), '5 - 5')
console.assert(MINUS(two)(one)(addBall)('!') === one(addBall)('!'), '2 - 1')
console.assert(MINUS(six)(four)(addBall)('!') === two(addBall)('!'), '6 - 4')
/* ----------------------------- სექციის დასაწყისი: ტესტი  -------------------------- */
// ტესტი წარმატებულად ჩაითვლება, თუ JavaScript-ის ინტერპრეტატორი უშეცდომოდ გაივლის ტესტს
